[
  {
    "id": "63206fcc-45b6-437c-8b70-625b21a3ca78",
    "usuario_id": "d949d81c-9235-41ce-8b3b-6b5d593c5e24",
    "tipo": "melhoria",
    "categoria": "emocional",
    "titulo": "Gestão da Ansiedade no Mercado Financeiro",
    "descricao": "Aldo demonstra ansiedade significativa relacionada às operações de curto prazo no mercado de criptomoedas, especialmente próxima ao horário de dormir, o que afeta seu descanso e bem-estar emocional.",
    "icone": "🕗",
    "prioridade": "alta",
    "ativo": true,
    "criado_em": "2025-11-06T11:51:58.186Z",
    "chat_id": "0fcc90ab-adf4-4445-a119-6686c616a8af",
    "resumo_situacao": "Aldo demonstra ansiedade significativa relacionada às operações de curto prazo no mercado de criptomoedas, especialmente próxima ao horário de dormir, o que afeta seu descanso e bem-estar emocional.",
    "feedback_positivo": "Você já tem clareza da origem da sua ansiedade e está criando limites claros para controlar isso, como fechar operações às 20h. Mostra uma disciplina emocional importante para sua saúde mental.",
    "feedback_desenvolvimento": "É fundamental continuar reforçando esses limites e evitar a tentação de renovar operações fora do horário estipulado, para consolidar a redução da ansiedade e melhorar o descanso noturno.",
    "feedback_motivacional": "Com essa organização e limites, você tende a experimentar um sono mais tranquilo e maior controle emocional, dando passos sólidos para uma rotina financeira mais saudável e equilibrada.",
    "recursos_sugeridos": [
      {
        "nome": "Ritual de Encerramento do Dia",
        "tipo": "tecnica",
        "descricao": "Técnica para criar um momento específico após fechar as operações, sinalizando para o cérebro que a fase de trabalho terminou.",
        "aplicacao_pratica": "Pode incluir uma breve meditação, desligar os dispositivos eletrônicos ou uma atividade relaxante que prepare para o descanso."
      },
      {
        "nome": "Registro Diário de Operações e Emoções",
        "tipo": "pratica",
        "descricao": "Prática de anotar diariamente as operações feitas e as sensações experimentadas para acompanhar padrões emocionais.",
        "aplicacao_pratica": "Utilize um aplicativo ou caderno para registrar o que foi feito e como se sentiu, ajudando a identificar gatilhos de ansiedade e melhorias."
      }
    ],
    "baseado_em": [
      "usuário relata ansiedade grande na hora de dormir por causa do mercado 24/7",
      "planejamento de encerrar operações todos os dias às 20h",
      "interesse em registrar desempenho e sensações para medir emoções"
    ]
  },
  {
    "id": "ef545222-59f4-432c-9473-0f2067ac309d",
    "usuario_id": "d949d81c-9235-41ce-8b3b-6b5d593c5e24",
    "tipo": "melhoria",
    "categoria": "cognitivo",
    "titulo": "Acompanhamento Objetivo para Redução de Ansiedade",
    "descricao": "Aldo quer acompanhar métricas e resultados diários das operações para evitar decisões impulsivas e melhorar o controle emocional no contexto financeiro.",
    "icone": "📊",
    "prioridade": "media",
    "ativo": true,
    "criado_em": "2025-11-06T11:51:58.186Z",
    "chat_id": "0fcc90ab-adf4-4445-a119-6686c616a8af",
    "resumo_situacao": "Aldo quer acompanhar métricas e resultados diários das operações para evitar decisões impulsivas e melhorar o controle emocional no contexto financeiro.",
    "feedback_positivo": "Sua iniciativa de registrar e monitorar métricas com atenção e disciplina mostra busca por autogestão e aprendizado contínuo.",
    "feedback_desenvolvimento": "É importante garantir que esse acompanhamento não vire fonte de cobrança excessiva ou ansiedade, mantendo uma postura de observação neutra.",
    "feedback_motivacional": "Com o hábito consolidado, será possível ajustar estratégias com clareza e tranquilidade, promovendo melhorias graduais e sustentáveis.",
    "recursos_sugeridos": [
      {
        "nome": "Registro Semanal de Performance",
        "tipo": "tecnica",
        "descricao": "Método de avaliar semanalmente resultados e sensações para identificar padrões de desempenho e emoção.",
        "aplicacao_pratica": "Revise as anotações feitas durante a semana para ajustar metas e estratégias sem pressa e sem julgamento."
      },
      {
        "nome": "Autocompaixão em Registros",
        "tipo": "conceito",
        "descricao": "Conceito que incentiva o olhar gentil e sem julgamento sobre erros e dificuldades no processo de autoavaliação.",
        "aplicacao_pratica": "Ao registrar resultados, pratique se tratar com gentileza para evitar frustrações e queda de motivação."
      }
    ],
    "baseado_em": [
      "usuário deseja criar rotina de registro das operações para medir métricas",
      "objetivo de evitar decisões impulsivas mostrando autocontrole"
    ]
  },
  {
    "id": "9a3fb5f7-38f4-494f-8ce9-05f70bd6b4fb",
    "usuario_id": "d949d81c-9235-41ce-8b3b-6b5d593c5e24",
    "tipo": "melhoria",
    "categoria": "comportamental",
    "titulo": "Consistência em Pequenas Metas Financeiras e Autocuidado",
    "descricao": "Aldo deseja criar metas curtas e alcançáveis focando no presente, evitando pressões do passado, e quer equilibrar o financeiro com autocuidado e lazer para manter a consistência.",
    "icone": "📅",
    "prioridade": "media",
    "ativo": true,
    "criado_em": "2025-11-06T11:51:58.186Z",
    "chat_id": "0fcc90ab-adf4-4445-a119-6686c616a8af",
    "resumo_situacao": "Aldo deseja criar metas curtas e alcançáveis focando no presente, evitando pressões do passado, e quer equilibrar o financeiro com autocuidado e lazer para manter a consistência.",
    "feedback_positivo": "Sua capacidade de identificar prioridades claras e querer incluir ações pequenas diárias demonstra um bom autoconhecimento e disciplina.",
    "feedback_desenvolvimento": "Vale atenção para manter a regularidade dessas pequenas ações sem se cobrar demais, para não gerar desgaste emocional que pode afetar a persistência.",
    "feedback_motivacional": "Criando esse equilíbrio diário entre metas e cuidados pessoais, você constrói uma base sólida para estabilidade financeira e mental, com progressos visíveis e sustentáveis.",
    "recursos_sugeridos": [
      {
        "nome": "Metas SMART",
        "tipo": "conceito",
        "descricao": "Princípio para definir objetivos que são específicos, mensuráveis, alcançáveis, relevantes e com prazo definido.",
        "aplicacao_pratica": "Pode ser usado para criar metas financeiras e de autocuidado que sejam concretas e realistas, facilitando o acompanhamento."
      },
      {
        "nome": "Janelas Temporais para Atividades",
        "tipo": "tecnica",
        "descricao": "Organização do tempo em blocos específicos para separar trabalho, monitoramento e lazer.",
        "aplicacao_pratica": "Reserve horários fixos para olhar o mercado, fazer exercícios, hobbies e descanso, evitando misturar as áreas e reduzindo estresse."
      }
    ],
    "baseado_em": [
      "usuário fala sobre criar metas objetivas e pequenas ações para consistência",
      "valoriza o equilíbrio entre financeiro e autocuidado",
      "planejamento para horários e atividades após as 20h"
    ]
  },
  {
    "id": "69198d61-08e2-4509-be45-0e47ca94bfba",
    "usuario_id": "d949d81c-9235-41ce-8b3b-6b5d593c5e24",
    "tipo": "positivo",
    "categoria": "cognitivo",
    "titulo": "Clareza e Organização Estratégica",
    "descricao": "Aldo demonstra clareza mental e organização ao definir estratégias no mercado financeiro, configurando alertas e aceitando limites do controle sobre o mercado, focando no que pode ser controlado.",
    "icone": "✅",
    "prioridade": "media",
    "ativo": true,
    "criado_em": "2025-11-03T09:04:36.753Z",
    "chat_id": "456c63a4-680f-42fa-b6f7-2805299d8145",
    "resumo_situacao": "Aldo demonstra clareza mental e organização ao definir estratégias no mercado financeiro, configurando alertas e aceitando limites do controle sobre o mercado, focando no que pode ser controlado.",
    "feedback_positivo": "Seu reconhecimento da impossibilidade de controlar o mercado e o foco nas estratégias sustentam um pensamento estruturado e realista, essencial para decisões conscientes.",
    "feedback_desenvolvimento": "Manter essa postura diante das pressões e emoções é um processo contínuo que reforça sua segurança e ajuda a minimizar decisões impulsivas.",
    "feedback_motivacional": "Continue fortalecendo essa clareza e disciplina, pois são seus maiores aliados para atravessar períodos de alta adrenalina com mais equilíbrio.",
    "recursos_sugeridos": [
      {
        "nome": "Controle vs Influência",
        "tipo": "conceito",
        "descricao": "Entendimento da diferença entre o que está sob seu controle e o que não está no mercado financeiro.",
        "aplicacao_pratica": "Refletir sempre sobre essa distinção ajuda a manter o foco no que realmente pode ser gerenciado, reduzindo ansiedade."
      },
      {
        "nome": "Auto diálogo Positivo",
        "tipo": "reflexao",
        "descricao": "Uso da conversa interna para manter a confiança e reforçar decisões baseadas em dados e estratégia.",
        "aplicacao_pratica": "Praticar o auto diálogo ajuda a manter o foco e a calma mesmo em momentos de tensão."
      }
    ],
    "baseado_em": [
      "\"Eu não tenho como controlar o mercado. Então, o que eu tenho é que definir uma estratégia.\"",
      "\"Fico conversando comigo na minha mente, explicando a estratégia fria que defini.\""
    ]
  },
  {
    "id": "412c64b5-4992-43fb-9aa6-e5b562f67b34",
    "usuario_id": "d949d81c-9235-41ce-8b3b-6b5d593c5e24",
    "tipo": "melhoria",
    "categoria": "emocional",
    "titulo": "Gerenciamento da Ansiedade na Tomada de Decisão",
    "descricao": "Aldo demonstra uma ansiedade significativa ao tentar antecipar operações no mercado, especialmente pela vontade de ganhar antes do momento estratégico, o que resulta em perdas. Ele consegue agir rápido movido pelo medo, mas tem dificuldade em manter a paciência na empolgação.",
    "icone": "🧘‍♂️",
    "prioridade": "alta",
    "ativo": true,
    "criado_em": "2025-11-03T09:04:36.753Z",
    "chat_id": "456c63a4-680f-42fa-b6f7-2805299d8145",
    "resumo_situacao": "Aldo demonstra uma ansiedade significativa ao tentar antecipar operações no mercado, especialmente pela vontade de ganhar antes do momento estratégico, o que resulta em perdas. Ele consegue agir rápido movido pelo medo, mas tem dificuldade em manter a paciência na empolgação.",
    "feedback_positivo": "Você já tem um ótimo controle ao agir rapidamente para se proteger no mercado, o que mostra uma boa capacidade de reação e consciência.",
    "feedback_desenvolvimento": "Percebe-se que a ansiedade para realizar ganhos rápidos te faz antecipar decisões, fugindo da estratégia planejada, um padrão que gera resultados negativos e merece atenção e manejo.",
    "feedback_motivacional": "Com pequenas práticas focadas no controle da ansiedade e na paciência, você pode fortalecer seu equilíbrio e seguir operando com ainda mais segurança e melhores resultados.",
    "recursos_sugeridos": [
      {
        "nome": "Técnica da Pausa Consciente",
        "tipo": "tecnica",
        "descricao": "Contar até 10 ou realizar uma inspiração profunda para reduzir a ansiedade antes de agir fora da estratégia.",
        "aplicacao_pratica": "Use essa técnica ao sentir vontade de antecipar a entrada, criando um espaço para avaliar se a ação condiz com o planejamento."
      },
      {
        "nome": "Registro das Sensações",
        "tipo": "reflexao",
        "descricao": "Anotar a sensação que surge quando a vontade de antecipar aparece, reconhecendo o gatilho emocional.",
        "aplicacao_pratica": "Registre rapidamente seu estado antes de agir para identificar padrões e aumentar o autocontrole."
      }
    ],
    "baseado_em": [
      "\"Eu sou mais ágil para executar estratégias baseadas no medo do que baseadas na empolgação.\"",
      "\"A ansiedade para ganhar dinheiro me atrapalha de esperar o mercado confirmar a alta.\""
    ]
  },
  {
    "id": "1bf0703d-86d7-4d79-a24a-3f3944355f5d",
    "usuario_id": "d949d81c-9235-41ce-8b3b-6b5d593c5e24",
    "tipo": "melhoria",
    "categoria": "comportamental",
    "titulo": "Estratégias para Aliviar a Tensão em Momentos Críticos",
    "descricao": "Aldo enfrenta momentos críticos do mercado onde precisa estar próximo do computador, o que aumenta a tensão e limita pausas e distrações, dificultando o manejo do estresse físico e mental.",
    "icone": "💡",
    "prioridade": "media",
    "ativo": true,
    "criado_em": "2025-11-03T09:04:36.753Z",
    "chat_id": "456c63a4-680f-42fa-b6f7-2805299d8145",
    "resumo_situacao": "Aldo enfrenta momentos críticos do mercado onde precisa estar próximo do computador, o que aumenta a tensão e limita pausas e distrações, dificultando o manejo do estresse físico e mental.",
    "feedback_positivo": "É notável que você mantém uma disciplina admirável, equilibrando atenção ao mercado com outras responsabilidades como o desenvolvimento do app e cuidados domésticos.",
    "feedback_desenvolvimento": "A limitação para se afastar da tela durante alertas torna difícil aliviar a tensão acumulada, o que pode impactar seu bem-estar se não for gerenciado com técnicas adaptadas ao contexto.",
    "feedback_motivacional": "Incorporar pequenos gestos de cuidado, mesmo na cadeira, pode ajudar a reduzir a tensão e melhorar seu estado geral, tornando os momentos críticos mais suportáveis.",
    "recursos_sugeridos": [
      {
        "nome": "Exercícios de Respiração Sentado",
        "tipo": "tecnica",
        "descricao": "Práticas rápidas de respiração profunda para aliviar a tensão sem sair do local.",
        "aplicacao_pratica": "Durante os momentos de espera, realize exercícios respiratórios para relaxar o corpo sem perder o foco."
      },
      {
        "nome": "Alongamento na Cadeira",
        "tipo": "tecnica",
        "descricao": "Movimentos simples para soltar ombros, pescoço e costas enquanto permanece sentado.",
        "aplicacao_pratica": "Faça pausas curtas para alongar essas áreas, ajudando a reduzir o desconforto físico."
      }
    ],
    "baseado_em": [
      "\"Eu não posso sair daqui, porque se o alerta tocar, eu tenho que estar próximo do computador.\"",
      "\"Inserir pequenos exercícios de respiração mesmo sentado, só para aliviar a tensão do corpo sem sair do lugar.\""
    ]
  },
  {
    "id": "9e098817-2193-421b-9b6e-f2704582fa96",
    "usuario_id": "d949d81c-9235-41ce-8b3b-6b5d593c5e24",
    "tipo": "positivo",
    "categoria": "emocional",
    "titulo": "Reconhecimento da capacidade de autogerenciamento emocional",
    "descricao": "Aldo demonstra momentos claros de autocontrole e uso de estratégias cognitivas para gerenciar sua ansiedade no mercado financeiro.",
    "icone": "🌟",
    "prioridade": "media",
    "ativo": true,
    "criado_em": "2025-10-31T13:37:47.587Z",
    "chat_id": "dd66a9b3-d455-4730-a683-b58ca8bb4a31",
    "resumo_situacao": "Aldo demonstra momentos claros de autocontrole e uso de estratégias cognitivas para gerenciar sua ansiedade no mercado financeiro.",
    "feedback_positivo": "Você já mostra grande resiliência ao conseguir observar os gráficos de longo prazo para reduzir o medo e tomar decisões mais conscientes.",
    "feedback_desenvolvimento": "Continue desenvolvendo esses espaços de calma e práticas de autoconhecimento para fortalecer sua estabilidade emocional.",
    "feedback_motivacional": "Esse reconhecimento é um sinal promissor de que você tem os recursos internos para continuar evoluindo e construindo tranquilidade nos desafios.",
    "recursos_sugeridos": [
      {
        "nome": "Mindfulness",
        "tipo": "conceito",
        "descricao": "Técnica de atenção plena envolvendo a observação sem julgamento dos próprios pensamentos e sentimentos.",
        "aplicacao_pratica": "Pratique manter a consciência dos seus sinais de ansiedade sem se envolver emocionalmente durante as operações."
      },
      {
        "nome": "O poder do agora - Eckhart Tolle",
        "tipo": "leitura",
        "descricao": "Livro que traz ensinamentos sobre viver no presente para diminuir ansiedade e pensamentos acelerados.",
        "aplicacao_pratica": "Leia para aprofundar a compreensão e a prática de foco no presente."
      }
    ],
    "baseado_em": [
      "'trouxe tranquilidade para diminuir pressão'",
      "'análise do gráfico para acalmar e reduzir medo'",
      "'capacidade real de se ancorar mesmo diante do medo'"
    ]
  },
  {
    "id": "1a84195b-76ca-4ee3-a24e-b1b9bc1909cc",
    "usuario_id": "d949d81c-9235-41ce-8b3b-6b5d593c5e24",
    "tipo": "melhoria",
    "categoria": "cognitivo",
    "titulo": "Criação e ajuste de checklist personalizado de ancoragem",
    "descricao": "Aldo solicitou um checklist de ancoragem para controle da ansiedade, mas rejeitou uma primeira versão por não se adequar bem às suas necessidades.",
    "icone": "📝",
    "prioridade": "media",
    "ativo": true,
    "criado_em": "2025-10-31T13:37:47.587Z",
    "chat_id": "dd66a9b3-d455-4730-a683-b58ca8bb4a31",
    "resumo_situacao": "Aldo solicitou um checklist de ancoragem para controle da ansiedade, mas rejeitou uma primeira versão por não se adequar bem às suas necessidades.",
    "feedback_positivo": "É excelente sua iniciativa ativa em buscar ferramentas que te ajudem, refletindo muito sobre que estratégias funcionam ou não.",
    "feedback_desenvolvimento": "É fundamental que o checklist seja personalizado e flexível ao seu contexto específico para que seja útil e adotado de fato.",
    "feedback_motivacional": "Vamos trabalhar juntos para refinar seu checklist, passo a passo, até encontrar uma versão que realmente faça diferença para você nas operações.",
    "recursos_sugeridos": [
      {
        "nome": "Diário de Estratégias de Ancoragem",
        "tipo": "pratica",
        "descricao": "Registro contínuo das técnicas usadas e os efeitos observados.",
        "aplicacao_pratica": "Anote cada vez que usar o checklist para avaliar o que funcionou e ajustar as estratégias."
      },
      {
        "nome": "Autoavaliação pós-operação",
        "tipo": "reflexao",
        "descricao": "Momento de reflexão após as operações para identificar gatilhos e respostas emocionais.",
        "aplicacao_pratica": "Reserve alguns minutos para revisar sua experiência e como o checklist ajudou ou pode ser melhorado."
      }
    ],
    "baseado_em": [
      "'faça esse checklist aí para mim, de ancoragem'",
      "'não está bom assim este checklist'",
      "'vamos continuar construindo juntos na próxima vez'"
    ]
  },
  {
    "id": "aab8d57f-5ecd-4962-98e0-b9af643c5448",
    "usuario_id": "d949d81c-9235-41ce-8b3b-6b5d593c5e24",
    "tipo": "melhoria",
    "categoria": "emocional",
    "titulo": "Gestão da ansiedade em momentos de alta pressão",
    "descricao": "Aldo enfrenta ansiedade intensa especialmente ao operar no mercado financeiro, com mente acelerada e dificuldade para pausas prolongadas durante momentos críticos.",
    "icone": "🧘‍♂️",
    "prioridade": "alta",
    "ativo": true,
    "criado_em": "2025-10-31T13:37:47.587Z",
    "chat_id": "dd66a9b3-d455-4730-a683-b58ca8bb4a31",
    "resumo_situacao": "Aldo enfrenta ansiedade intensa especialmente ao operar no mercado financeiro, com mente acelerada e dificuldade para pausas prolongadas durante momentos críticos.",
    "feedback_positivo": "Você demonstra grande autoconsciência ao reconhecer os momentos em que consegue se acalmar, como ao analisar gráficos de longo prazo e ajustar estratégias.",
    "feedback_desenvolvimento": "É importante fortalecer essas técnicas e criar estratégias específicas para lidar com a ansiedade em tempo real durante operações, para evitar decisões precipitada e perda de controle emocional.",
    "feedback_motivacional": "Com foco e prática, você pode ampliar esses momentos de calma e ganhar mais controle, construindo uma rotina que suporte sua tranquilidade nas horas de maior pressão.",
    "recursos_sugeridos": [
      {
        "nome": "Exercícios de ancoragem",
        "tipo": "tecnica",
        "descricao": "Métodos focados em trazer a atenção para o presente através de estímulos sensoriais ou pensamentos concretos.",
        "aplicacao_pratica": "Use uma âncora rápida como observar um objeto físico ou ouvir um som calmante para reduzir a ansiedade no meio das operações."
      },
      {
        "nome": "Respiração profunda",
        "tipo": "tecnica",
        "descricao": "Controle respiratório pausado para ativar resposta de calma do corpo.",
        "aplicacao_pratica": "Inspire e expire lentamente por 30 segundos focando no ar, para desacelerar o ritmo cardíaco e centro mental."
      }
    ],
    "baseado_em": [
      "'tô conseguindo exercitar um pouco a questão das dicas de pausar e respirar'",
      "'mente muito acelerada e ansiedade muito alta no momento de operar'",
      "'análise de gráficos de longo prazo para acalmar'"
    ]
  },
  {
    "id": "07ad2c89-7981-4796-8fcb-ccc53671f5de",
    "usuario_id": "d949d81c-9235-41ce-8b3b-6b5d593c5e24",
    "tipo": "alerta",
    "categoria": "emocional",
    "titulo": "Autoempatia e Gestão da Frustração",
    "descricao": "Aldo sente raiva e frustração por não conseguir seguir o próprio plano, o que aumenta a autocrítica e o medo de repetir erros.",
    "icone": "❤️",
    "prioridade": "media",
    "ativo": true,
    "criado_em": "2025-10-30T15:06:39.883Z",
    "chat_id": "ec3b2860-defd-4031-be17-d69e68d39776",
    "resumo_situacao": "Aldo sente raiva e frustração por não conseguir seguir o próprio plano, o que aumenta a autocrítica e o medo de repetir erros.",
    "feedback_positivo": "A consciência sobre a necessidade de mais empatia consigo mesmo mostra um nível significativo de autocuidado e reflexão emocional.",
    "feedback_desenvolvimento": "Essa autocrítica severa pode intensificar o estresse e sabotagem emocional, dificultando a recuperação emocional e o aprendizado com erros.",
    "feedback_motivacional": "Aprender a se perdoar e praticar autoempatia é fundamental para aliviar a raiva interna e fortalecer a resiliência emocional para futuros desafios.",
    "recursos_sugeridos": [
      {
        "nome": "Prática de Autoempatia",
        "tipo": "tecnica",
        "descricao": "Dialogar consigo mesmo como faria com um amigo, oferecendo compreensão e suporte.",
        "aplicacao_pratica": "Em momentos de frustração, praticar falar palavras de apoio e reconhecimento das tentativas e aprendizados."
      },
      {
        "nome": "Sabotadores Internos",
        "tipo": "conceito",
        "descricao": "Entender os padrões emocionais que levam a comportamentos autossabotadores.",
        "aplicacao_pratica": "Refletir sobre quais sabotadores ativam a autocrítica para desenvolver compassividade e novas respostas emocionais."
      }
    ],
    "baseado_em": [
      "Sentimento de raiva por erros conhecidos",
      "Reconhecimento da necessidade de ter mais empatia consigo mesmo"
    ]
  }
]