[
  {
    "output": "Mapa Mental Textual - Áreas de Vida e Pontos Focais das Conversas de Aldo\n\n1. Área: Saúde Emocional\n   > Controle e Gestão Emocional > \n      - Reconhecimento e monitoramento das emoções e gatilhos (uso do próprio app para autoconhecimento, registro de humor e sabotadores mentais)\n      - Utilização de técnicas diversas (respiração, pausas curtas, autorreflexão, meditação, afirmações, caminhada com música)\n      - Dificuldade em aplicar técnicas tradicionais sob pressão do mercado\n      - Oscilações entre ansiedade, medo, otimismo e frustração\n      - Impacto de perdas financeiras e separação conjugal, solidão como elemento presente na vida desde infância\n      - Importância do equilíbrio entre mente, disciplina e rotina estruturada\n      - Suporte por terapia e coaching para manejo emocional\n      - Conflitos internos entre urgência, impulsividade e disciplina planejada\n   > Padrões:\n      - Ciclos de ansiedade intensa ligados ao mercado financeiro e oscilações de humor imprevisíveis\n      - Autoexigência elevada e impulsividade (sabotares internos: “Hiperrealizador”, “Inquieto”, “Exigente Implacável”, “Mente Turbulenta”)\n      - Uso do app e auto-monitoramento como ferramentas chave para autocontrole e insight\n   > Oportunidades Práticas:\n      - Criação e adaptação personalizada de checklist e rituais para gestão emocional em operação\n      - Estabelecimento de rotinas diárias com tarefas essenciais, técnica Pomodoro e celebrações de pequenas vitórias\n      - Aplicação contínua do coaching e terapia focadas em gatilhos emocionais e sabotadores internos\n      - Desenvolvimento de um ritual semanal que combine revisão financeira e autocuidado\n   > Próximos Passos Prioritários:\n      - Ajuste e lapidação do checklist emocional para operar sob pressão em mercados voláteis\n      - Estruturar rotina diária eficaz que inclua cuidados emocionais, pausas e autorreflexão\n      - Intensificar o suporte terapêutico para trabalhar sabotadores internos específicos\n      - Desenvolver e implementar plano semanal integrado para resiliência e controle da ansiedade\n\n2. Área: Trabalho / Finanças e Carreira\n   > Mercado Financeiro e Investimentos >\n      - Experiência de altos riscos em criptomoedas e ações, com padrão repetitivo de perdas e recuperação difícil\n      - Uso de estratégias e alertas técnicos para controle de risco e limite de perdas (stops, análise técnica e macroeconômica)\n      - Dilema entre assumir prejuízo e sair do mercado ou manter aposta arriscada para recuperação rápida\n      - Oscilação emocional prejudica disciplina e execução do plano financeiro rigoroso\n      - Redução de alavancagem recente para controle de ansiedade e estabilidade\n      - Necessidade de limitações objetivas no tempo de operação para evitar ansiedade noturna e decisões impulsivas\n      - Intenção de desenvolver agente de IA personalizado para automação, lembretes visuais e suporte disciplinar\n      - Criação de reserva financeira como proteção contra perdas extremas\n   > Projeto de Desenvolvimento do App e Negócio Próprio >\n      - Progresso significativo e motivação alta, com foco em desenvolvimento pessoal e autoconhecimento\n      - Adoção de metodologias para superar perfeccionismo e burocracia (fixar datas-limite, envolver pessoas para feedback, consultoria para marketing e questões legais)\n      - Uso do app como ferramenta pessoal e produto para terceiros, com potencial gerador de renda futura\n      - Sinergia entre paixão por tecnologia, IA e crescimento pessoal\n      - Planejamento de consultoria em TI e agência de automações com IA\n   > Padrões:\n      - Alternância entre sucesso parcial (aplicação de estratégias, progresso no app) e ciclos de perdas financeiras\n      - Frustração com decisões impulsivas e medo, impactando a performance\n      - Necessidade constante de equilíbrio entre disciplina e controle emocional para manter resultados\n      - Alto impacto emocional do mercado no rendimento profissional e pessoal\n   > Oportunidades Práticas:\n      - Continuidade da redução controlada da alavancagem e limites claros para operações diárias\n      - Automatização e uso de tecnologia para apoio na disciplina e redução do viés emocional\n      - Estruturação do negócio próprio (app e consultoria) como alternativa estável de renda\n      - Externalização de tarefas burocráticas e marketing com apoio especializado para manter foco estratégico\n   > Próximos Passos Prioritários:\n      - Implementar o agente de IA personalizado para suporte disciplinar e emocional nas operações\n      - Finalizar e lançar a versão beta do app, adotando abordagem ágil para superar perfeccionismo\n      - Definir limites rígidos para operações no mercado (horário, alavancagem, volume)\n      - Planejar roadmap de consultoria de TI e agência para fonte alternativa de renda\n      - Buscar consultoria jurídica e de marketing para aliviar burocracia\n\n3. Área: Relacionamentos e Vida Pessoal\n   > Família e Relações Próximas >\n      - Manutenção de contato frequente e momentos positivos com filhos\n      - Impacto emocional do aniversário do filho, separação conjugal e saudade/solidão decorrentes\n      - Desejo de reconstrução de relacionamento afetivo saudável e reaproximação familiar, incluindo possível mudança para o Brasil\n      - Valorização do apoio emocional de familiares e amigos\n      - Conflito entre hiperfoco no trabalho e necessidade de atenção aos relacionamentos\n   > Autocuidado e Lazer >\n      - Prática regular de academia, caminhadas, alongamento e socialização como fontes de energia e equilíbrio\n      - Tentativas e dificuldades em manter meditação e respiração consciente como relaxamento\n      - Valorização do tempo de qualidade relaxando próximo a alguém querido\n      - Oscilação da energia impactando motivação para manter cuidados físicos\n   > Padrões:\n      - Solidão histórica presente na infância e vida adulta, agravada por separação e foco excessivo no trabalho\n      - Esforço consciente para equilibrar dedicação ao app, finanças e autocuidado\n      - Necessidade de tempo livre para recarregar energia e preservar espaço pessoal\n   > Oportunidades Práticas:\n      - Planejamento e execução gradual de reaproximação com filhos e retomada do convívio familiar\n      - Definir e proteger tempo reservado para autocuidado e lazer, com atividades restauradoras\n      - Adotar práticas para aumentar presença e qualidade nas relações afetivas\n      - Uso do app para monitorar equilíbrio entre trabalho, finanças e vida pessoal\n   > Próximos Passos Prioritários:\n      - Priorizar agenda para maior contato e qualidade com filhos; avaliar mudança para Brasil conforme viabilidade\n      - Estabelecer rotina semanal que contemple atividades físicas e momentos de lazer restauradores\n      - Buscar apoio terapêutico e coaching para desenvolvimento de competências sociais e afetivas\n      - Equilibrar foco nas metas profissionais com a necessidade intrínseca de conexão e presença nos relacionamentos\n\n4. Área: Saúde Física\n   > Rotinas e Condições de Saúde >\n      - Reconhecimento da importância da atividade física (academia, caminhada) para energia, felicidade e equilíbrio emocional\n      - Relatos de sintomas ocasionais: sinusite, dor de cabeça, sono perturbado e baixa energia em dias específicos\n      - Preocupação em manter frequência de exercícios apesar do cansaço e rotina intensa\n      - Uso do descanso e pausas ativas para recuperação física e mental\n   > Padrões:\n      - Saúde física impacta diretamente a energia e capacidade produtiva e emocional\n      - As oscilações de saúde são em parte atribuídas ao estresse do trabalho e mercado financeiro\n      - Pequenos cuidados e pausas estratégicas promovem melhor desempenho geral\n   > Oportunidades Práticas:\n      - Manter e intensificar rotina regular de exercícios físicos adaptativa às demandas do dia\n      - Programar pausas ativas e atividades relaxantes quando necessário para prevenção de exaustão\n      - Utilizar autocuidado como ferramenta integrada no plano de equilíbrio global\n   > Próximos Passos Prioritários:\n      - Definir metas semanais realistas para atividades físicas e descanso\n      - Monitorar sintomas e ajustar rotina para evitar sobrecarga e cansaço crônico\n      - Inclusão sistemática de pausas ativas e práticas restaurativas no dia a dia\n\n---\n\nResumo dos Próximos Passos Prioritários por Área:\n\n- Saúde Emocional:\n   1. Ajustar checklist emocional e desenvolver ritual semanal para controle da ansiedade.\n   2. Estabelecer rotina diária estruturada com cuidados emocionais e autorreflexão.\n   3. Intensificar suporte psicológico para manejo dos sabotadores internos.\n\n- Trabalho / Finanças:\n   1. Implementar o agente de IA para suporte disciplinar nas operações.\n   2. Concluir e lançar o app, superando perfeccionismo com apoio de coach.\n   3. Limitar operações financeiras com critérios claros para minimizar risco e ansiedade.\n   4. Avançar no planejamento e estruturação da consultoria e agência de automações.\n   5. Delegar questões burocráticas e marketing para especialistas.\n\n- Relacionamentos e Vida Pessoal:\n   1. Priorizar plano de reaproximação familiar e definir possível mudança ao Brasil.\n   2. Garantir espaço regular para autocuidado, lazer e relacionamento afetivo.\n   3. Buscar terapia e coaching focados em relações interpessoais e equilíbrio vida-trabalho.\n\n- Saúde Física:\n   1. Consolidar rotina de exercícios consistentes e pausas estratégicas.\n   2. Ajustar cuidados para evitar cansaço e sintomas físicos relacionados ao estresse.\n   3. Integrar autocuidado físico como parte da disciplina geral do dia a dia.\n\nEste mapa mental textual sintetiza os principais pontos focais e ações práticas para Aldo buscar equilíbrio e progresso integrado em suas áreas vitais."
  }
]